benchmark/fio/results/home_02.txt
======= Output file: /home/llm-jp-admin/io_test/tmp_94.fio =======
======= Sequential write =======
sequential_write: (g=0): rw=write, bs=(R) 32.0KiB-32.0KiB, (W) 32.0KiB-32.0KiB, (T) 32.0KiB-32.0KiB, ioengine=psync, iodepth=1
...
fio-3.37-60-g6eaa64
Starting 16 processes
sequential_write: Laying out IO file (1 file / 1024MiB)

sequential_write: (groupid=0, jobs=16): err= 0: pid=240285: Tue Jul  9 18:45:04 2024
  write: IOPS=110k, BW=3441MiB/s (3608MB/s)(16.0GiB/4761msec); 0 zone resets
    clat (usec): min=8, max=114099, avg=140.03, stdev=1876.37
     lat (usec): min=9, max=114099, avg=140.57, stdev=1877.65
    clat percentiles (usec):
     |  1.00th=[   12],  5.00th=[   13], 10.00th=[   13], 20.00th=[   13],
     | 30.00th=[   14], 40.00th=[   15], 50.00th=[   16], 60.00th=[   18],
     | 70.00th=[   19], 80.00th=[   21], 90.00th=[   26], 95.00th=[   29],
     | 99.00th=[   51], 99.50th=[ 8160], 99.90th=[32637], 99.95th=[40633],
     | 99.99th=[60031]
   bw (  MiB/s): min= 2405, max= 4652, per=100.00%, avg=3465.93, stdev=48.58, samples=144
   iops        : min=76964, max=148877, avg=110908.44, stdev=1554.53, samples=144
  lat (usec)   : 10=0.08%, 20=78.90%, 50=20.01%, 100=0.20%, 250=0.06%
  lat (usec)   : 500=0.02%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.04%, 4=0.06%, 10=0.15%, 20=0.22%, 50=0.21%
  lat (msec)   : 100=0.02%, 250=0.01%
  cpu          : usr=0.66%, sys=11.89%, ctx=11230, majf=0, minf=492
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,524288,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=3441MiB/s (3608MB/s), 3441MiB/s-3441MiB/s (3608MB/s-3608MB/s), io=16.0GiB (17.2GB), run=4761-4761msec
======= Sequential read =======
sequential_read: (g=0): rw=read, bs=(R) 32.0KiB-32.0KiB, (W) 32.0KiB-32.0KiB, (T) 32.0KiB-32.0KiB, ioengine=psync, iodepth=1
...
fio-3.37-60-g6eaa64
Starting 16 processes

sequential_read: (groupid=0, jobs=16): err= 0: pid=240314: Tue Jul  9 18:45:07 2024
  read: IOPS=224k, BW=6996MiB/s (7336MB/s)(16.0GiB/2342msec)
    clat (usec): min=2, max=115230, avg=41.14, stdev=1159.23
     lat (usec): min=2, max=115230, avg=41.19, stdev=1159.23
    clat percentiles (usec):
     |  1.00th=[    3],  5.00th=[    4], 10.00th=[    4], 20.00th=[    4],
     | 30.00th=[    4], 40.00th=[    4], 50.00th=[    5], 60.00th=[    5],
     | 70.00th=[    5], 80.00th=[    6], 90.00th=[    6], 95.00th=[    7],
     | 99.00th=[   10], 99.50th=[   11], 99.90th=[23462], 99.95th=[28967],
     | 99.99th=[43779]
   bw (  MiB/s): min= 1537, max=12230, per=100.00%, avg=8129.67, stdev=300.80, samples=48
   iops        : min=49188, max=391386, avg=260149.33, stdev=9625.70, samples=48
  lat (usec)   : 4=44.45%, 10=54.89%, 20=0.50%, 50=0.03%, 100=0.01%
  lat (usec)   : 250=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.10%
  lat (msec)   : 100=0.01%, 250=0.01%
  cpu          : usr=0.61%, sys=11.91%, ctx=1495, majf=0, minf=652
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=524288,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=6996MiB/s (7336MB/s), 6996MiB/s-6996MiB/s (7336MB/s-7336MB/s), io=16.0GiB (17.2GB), run=2342-2342msec
======= Random write =======
random_write: (g=0): rw=randwrite, bs=(R) 32.0KiB-32.0KiB, (W) 32.0KiB-32.0KiB, (T) 32.0KiB-32.0KiB, ioengine=psync, iodepth=1
...
fio-3.37-60-g6eaa64
Starting 16 processes

random_write: (groupid=0, jobs=16): err= 0: pid=240341: Tue Jul  9 18:45:13 2024
  write: IOPS=81.4k, BW=2544MiB/s (2667MB/s)(12.4GiB/5007msec); 0 zone resets
    clat (usec): min=9, max=75466, avg=160.51, stdev=1902.49
     lat (usec): min=9, max=75467, avg=162.20, stdev=1912.27
    clat percentiles (usec):
     |  1.00th=[   15],  5.00th=[   16], 10.00th=[   17], 20.00th=[   17],
     | 30.00th=[   17], 40.00th=[   18], 50.00th=[   18], 60.00th=[   18],
     | 70.00th=[   19], 80.00th=[   22], 90.00th=[   24], 95.00th=[   25],
     | 99.00th=[   36], 99.50th=[11731], 99.90th=[31065], 99.95th=[38011],
     | 99.99th=[45876]
   bw (  MiB/s): min= 1067, max= 3762, per=100.00%, avg=2834.61, stdev=48.55, samples=143
   iops        : min=34156, max=120388, avg=90707.25, stdev=1553.52, samples=143
  lat (usec)   : 10=0.01%, 20=75.98%, 50=23.24%, 100=0.03%, 250=0.01%
  lat (usec)   : 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.02%, 10=0.15%, 20=0.24%, 50=0.32%
  lat (msec)   : 100=0.01%
  cpu          : usr=0.56%, sys=11.23%, ctx=5591, majf=0, minf=488
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,407572,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=2544MiB/s (2667MB/s), 2544MiB/s-2544MiB/s (2667MB/s-2667MB/s), io=12.4GiB (13.4GB), run=5007-5007msec
======= Random read =======
random_read: (g=0): rw=randread, bs=(R) 32.0KiB-32.0KiB, (W) 32.0KiB-32.0KiB, (T) 32.0KiB-32.0KiB, ioengine=psync, iodepth=1
...
fio-3.37-60-g6eaa64
Starting 16 processes

random_read: (groupid=0, jobs=16): err= 0: pid=240368: Tue Jul  9 18:45:16 2024
  read: IOPS=171k, BW=5347MiB/s (5607MB/s)(16.0GiB/3064msec)
    clat (usec): min=2, max=54015, avg=52.91, stdev=1220.15
     lat (usec): min=2, max=54015, avg=53.16, stdev=1223.26
    clat percentiles (usec):
     |  1.00th=[    6],  5.00th=[    6], 10.00th=[    7], 20.00th=[    7],
     | 30.00th=[    7], 40.00th=[    7], 50.00th=[    7], 60.00th=[    7],
     | 70.00th=[    7], 80.00th=[    7], 90.00th=[    8], 95.00th=[    8],
     | 99.00th=[    9], 99.50th=[   12], 99.90th=[27919], 99.95th=[30016],
     | 99.99th=[43779]
   bw (  MiB/s): min= 5447, max= 9063, per=100.00%, avg=7965.56, stdev=97.84, samples=61
   iops        : min=174326, max=290038, avg=254898.00, stdev=3130.86, samples=61
  lat (usec)   : 4=0.05%, 10=99.18%, 20=0.57%, 50=0.05%, 100=0.01%
  lat (usec)   : 250=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.15%
  lat (msec)   : 100=0.01%
  cpu          : usr=0.59%, sys=11.95%, ctx=1904, majf=0, minf=652
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=524288,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=5347MiB/s (5607MB/s), 5347MiB/s-5347MiB/s (5607MB/s-5607MB/s), io=16.0GiB (17.2GB), run=3064-3064msec