benchmark/fio/results/home_03.txt
======= Output file: /home/llm-jp-admin/io_test/tmp_101.fio =======
======= Sequential write =======
sequential_write: (g=0): rw=write, bs=(R) 32.0KiB-32.0KiB, (W) 32.0KiB-32.0KiB, (T) 32.0KiB-32.0KiB, ioengine=psync, iodepth=1
...
fio-3.37-60-g6eaa64
Starting 16 processes
sequential_write: Laying out IO file (1 file / 1024MiB)

sequential_write: (groupid=0, jobs=16): err= 0: pid=260937: Tue Jul  9 19:03:18 2024
  write: IOPS=113k, BW=3546MiB/s (3718MB/s)(16.0GiB/4621msec); 0 zone resets
    clat (usec): min=9, max=150601, avg=135.05, stdev=1779.69
     lat (usec): min=9, max=150602, avg=135.75, stdev=1782.92
    clat percentiles (usec):
     |  1.00th=[   12],  5.00th=[   13], 10.00th=[   13], 20.00th=[   13],
     | 30.00th=[   13], 40.00th=[   14], 50.00th=[   16], 60.00th=[   17],
     | 70.00th=[   18], 80.00th=[   20], 90.00th=[   25], 95.00th=[   29],
     | 99.00th=[   48], 99.50th=[ 8291], 99.90th=[30016], 99.95th=[38011],
     | 99.99th=[57410]
   bw (  MiB/s): min= 2670, max= 4692, per=100.00%, avg=3597.47, stdev=45.27, samples=137
   iops        : min=85464, max=150150, avg=115115.69, stdev=1448.59, samples=137
  lat (usec)   : 10=0.03%, 20=82.19%, 50=16.81%, 100=0.13%, 250=0.07%
  lat (usec)   : 500=0.02%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.03%, 4=0.06%, 10=0.16%, 20=0.23%, 50=0.21%
  lat (msec)   : 100=0.01%, 250=0.01%
  cpu          : usr=0.70%, sys=11.83%, ctx=10819, majf=0, minf=492
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,524288,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=3546MiB/s (3718MB/s), 3546MiB/s-3546MiB/s (3718MB/s-3718MB/s), io=16.0GiB (17.2GB), run=4621-4621msec
======= Sequential read =======
sequential_read: (g=0): rw=read, bs=(R) 32.0KiB-32.0KiB, (W) 32.0KiB-32.0KiB, (T) 32.0KiB-32.0KiB, ioengine=psync, iodepth=1
...
fio-3.37-60-g6eaa64
Starting 16 processes

sequential_read: (groupid=0, jobs=16): err= 0: pid=260968: Tue Jul  9 19:03:21 2024
  read: IOPS=232k, BW=7237MiB/s (7588MB/s)(16.0GiB/2264msec)
    clat (usec): min=2, max=117908, avg=43.61, stdev=1210.95
     lat (usec): min=2, max=117908, avg=43.95, stdev=1215.37
    clat percentiles (usec):
     |  1.00th=[    3],  5.00th=[    4], 10.00th=[    4], 20.00th=[    4],
     | 30.00th=[    4], 40.00th=[    5], 50.00th=[    5], 60.00th=[    5],
     | 70.00th=[    5], 80.00th=[    6], 90.00th=[    6], 95.00th=[    7],
     | 99.00th=[   10], 99.50th=[   11], 99.90th=[23200], 99.95th=[29754],
     | 99.99th=[43779]
   bw (  MiB/s): min= 5294, max=11351, per=100.00%, avg=9074.67, stdev=176.25, samples=48
   iops        : min=169424, max=363232, avg=290389.33, stdev=5639.89, samples=48
  lat (usec)   : 4=37.47%, 10=61.85%, 20=0.51%, 50=0.03%, 100=0.01%
  lat (usec)   : 250=0.01%, 500=0.01%, 750=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.10%
  lat (msec)   : 100=0.01%, 250=0.01%
  cpu          : usr=0.61%, sys=11.97%, ctx=1415, majf=0, minf=652
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=524288,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=7237MiB/s (7588MB/s), 7237MiB/s-7237MiB/s (7588MB/s-7588MB/s), io=16.0GiB (17.2GB), run=2264-2264msec
======= Random write =======
random_write: (g=0): rw=randwrite, bs=(R) 32.0KiB-32.0KiB, (W) 32.0KiB-32.0KiB, (T) 32.0KiB-32.0KiB, ioengine=psync, iodepth=1
...
fio-3.37-60-g6eaa64
Starting 16 processes

random_write: (groupid=0, jobs=16): err= 0: pid=261003: Tue Jul  9 19:03:26 2024
  write: IOPS=84.1k, BW=2628MiB/s (2756MB/s)(12.9GiB/5015msec); 0 zone resets
    clat (usec): min=9, max=70821, avg=163.32, stdev=1918.37
     lat (usec): min=9, max=70821, avg=164.98, stdev=1929.35
    clat percentiles (usec):
     |  1.00th=[   15],  5.00th=[   16], 10.00th=[   17], 20.00th=[   17],
     | 30.00th=[   17], 40.00th=[   18], 50.00th=[   18], 60.00th=[   18],
     | 70.00th=[   19], 80.00th=[   22], 90.00th=[   24], 95.00th=[   28],
     | 99.00th=[   37], 99.50th=[12256], 99.90th=[32113], 99.95th=[37487],
     | 99.99th=[47973]
   bw (  MiB/s): min= 2050, max= 3771, per=100.00%, avg=2927.55, stdev=38.37, samples=143
   iops        : min=65616, max=120672, avg=93681.39, stdev=1227.83, samples=143
  lat (usec)   : 10=0.01%, 20=75.30%, 50=23.89%, 100=0.04%, 250=0.01%
  lat (usec)   : 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.02%, 10=0.15%, 20=0.25%, 50=0.32%
  lat (msec)   : 100=0.01%
  cpu          : usr=0.50%, sys=11.32%, ctx=5777, majf=0, minf=489
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,421801,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=2628MiB/s (2756MB/s), 2628MiB/s-2628MiB/s (2756MB/s-2756MB/s), io=12.9GiB (13.8GB), run=5015-5015msec
======= Random read =======
random_read: (g=0): rw=randread, bs=(R) 32.0KiB-32.0KiB, (W) 32.0KiB-32.0KiB, (T) 32.0KiB-32.0KiB, ioengine=psync, iodepth=1
...
fio-3.37-60-g6eaa64
Starting 16 processes

random_read: (groupid=0, jobs=16): err= 0: pid=261030: Tue Jul  9 19:03:30 2024
  read: IOPS=168k, BW=5241MiB/s (5496MB/s)(16.0GiB/3126msec)
    clat (usec): min=2, max=56021, avg=53.26, stdev=1235.41
     lat (usec): min=2, max=56021, avg=53.85, stdev=1243.44
    clat percentiles (usec):
     |  1.00th=[    6],  5.00th=[    6], 10.00th=[    7], 20.00th=[    7],
     | 30.00th=[    7], 40.00th=[    7], 50.00th=[    7], 60.00th=[    7],
     | 70.00th=[    7], 80.00th=[    8], 90.00th=[    8], 95.00th=[    8],
     | 99.00th=[    9], 99.50th=[   12], 99.90th=[27919], 99.95th=[31065],
     | 99.99th=[43779]
   bw (  MiB/s): min= 4738, max= 9021, per=100.00%, avg=7737.73, stdev=113.58, samples=63
   iops        : min=151642, max=288678, avg=247607.50, stdev=3634.44, samples=63
  lat (usec)   : 4=0.04%, 10=99.17%, 20=0.59%, 50=0.05%, 100=0.01%
  lat (usec)   : 250=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.14%
  lat (msec)   : 100=0.01%
  cpu          : usr=0.59%, sys=11.95%, ctx=1925, majf=0, minf=652
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=524288,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=5241MiB/s (5496MB/s), 5241MiB/s-5241MiB/s (5496MB/s-5496MB/s), io=16.0GiB (17.2GB), run=3126-3126msec